api/modules/v1_1/controllers/CategoryController.php

    public function actionGetList() {
        $category = Category::find()->where(['is_active' => Category::IS_ACTIVE])->all();
        if($category) {
            $data = ArrayHelper::toArray($category);
            $data['count'] = Category::find()->where(['is_active' => Category::IS_ACTIVE])->count();
---
SELECT COUNT(*) FROM `category` WHERE `is_active`=1