api/modules/v1_1/controllers/DatesController.php

INSERT INTO `dates` (`id_gift_receiver`, `date_m`, `date_d`, `date_y`, `custom_holiday`, `id_holiday`) VALUES (2, 10, 10, '10', 'custom_holiday new column', NULL)
INSERT INTO `gift` (`from`, `to`, `id_dates`) VALUES (10, 10, 84)
---
    public function actionCreate() {
        $dates = new Dates();
		$gift = new Gift();
		$post = Yii::$app->request->post();
		$tags = [];

		if ($dates->load($post) && $gift->load($post)) {
			if ($dates->validate() && $gift->validate(['from', 'to'])) {
				if ($dates->save()) {
					$gift->id_dates = $dates->id;
					$gift->save();

UPDATE `gift` SET `from`=10, `to`=10 WHERE `id`=2
UPDATE `dates` SET `id_gift_receiver`=2, `date_m`=10, `date_d`=10 WHERE `id`=10
---
    public function actionUpdate($id) {
        $dates = $this->findModel($id);
		$gift = $dates->gift;
        $post = \Yii::$app->getRequest()->getBodyParams();
		$tags = [];

        if ($dates->load($post) && $gift->load($post)) {
			if ($dates->validate() && $gift->validate(['from', 'to'])) {
				if ($dates->save()) {