api/modules/v1_1/controllers/GiftReceiverController.php

	public function actionGetCountry() {
        return $this->responseSuccess(ArrayHelper::map(Country::find()->all(), 'id', 'name'));
---
SELECT * FROM `country`

    public function actionCreate() {
        $model = new GiftReceiver();
        $post = \Yii::$app->getRequest()->post();

        if ($model->load($post, '')) {
            if($model->save()) {
---
INSERT INTO `gift_receiver` (`first_name`, `last_name`, `email`, `phone`, `gender`, `id_user`, `is_active`, `birthday_day`, `birthday_month`, `id_relation`, `address_type`, `id_country`, `city`, `address1`, `custom_state`, `birthday_year`, `id_state`, `is_approximate_age`, `birthday`) VALUES ('test1534338773', 'test21534338773', 'test1534338773@test.ua', '+1(066) 111-11-37', 2, 2, 1, 28, 4, 1, 1, 1, 'Babruisk', 'Street 3 tarakana', 'custom_state test', 1985, NULL, 1, '1985-04-28')